meeting/agenda/2025/05-27.org
*** To be triaged
:PROPERTIES:
:CUSTOM_ID: triage
:END:

The following issues need to be triaged.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/2025][#2025]]: Combine the concepts of pins/labels and modified lookups
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2022][#2022]]: Simplify optional XQuery conformance features
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2021][#2021]]: XSLT: Move "Patterns" section into "Template Rules"
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2018][#2018]]: Type-checking the result of xsl:apply-templates
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2017][#2017]]: `fn:sort-by`: Observations
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2016][#2016]]: File Module: Incorporate changes
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2012][#2012]]: Add array:sort-with
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2010][#2010]]: XSLT patterns: generalize union, intersect, and except
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2007][#2007]]: Creating arrays in XSLT
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2003][#2003]]: Conditional entries in map constructors
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2002][#2002]]: Adaptive serialization: QNames
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2000][#2000]]: element-to-map() - type signature of plan
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1996][#1996]]: Lookups, KeySpecifier: add NumericLiteral and ContextValueRef?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1995][#1995]]: Consistency: array lookups
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1980][#1980]]: HTML serialization: the rules for adding a meta element need to be aligned with HTML5
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1979][#1979]]: Records: Type Safety
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1970][#1970]]: Editorial notes
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1955][#1955]]: fn:doc, fn:parse-xml: entity expansion
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1949][#1949]]: fn:element-to-map: Updated Feedback
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1948][#1948]]: fn:element-to-map: Tests
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1946][#1946]]: We need examples of a record with an entry that is a %method and invoking this method with the result it must produce
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1944][#1944]]: Try/Catch/Finally - order of evaluation
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1938][#1938]]: Invoking coerced methods
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1935][#1935]]: doc-available() with invalid options
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1934][#1934]]: Supporting RELAX NG validation
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1920][#1920]]: Parse functions: determinism
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1912][#1912]]: Error handling: `fn:throw`
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1903][#1903]]: `fn:scan-left`, `fn:scan-right`: missing steps
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1885][#1885]]: Use the spcification grammar markup to define the regular expression grammar in F&O
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1871][#1871]]: Arrays and maps: consistency
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1868][#1868]]: array:members() to include index position
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1859][#1859]]: Question on `fn:chain` and `err:FOAP0001`
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1852][#1852]]: fn:values-except: Return atomic values that occur in A but not in B
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1787][#1787]]: Sorted maps revisited
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1775][#1775]]: Navigation in JSON trees
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1774][#1774]]: Nomenclature: relabelling
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1736][#1736]]: Add option retain-order=false when constructing maps
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1718][#1718]]: Ordered Maps: positions in callback functions
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1697][#1697]]: Add documentary names to callback function signatures
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1618][#1618]]: Adaptive serialization: doubles
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1591][#1591]]: Implausible filter expressions
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1583][#1583]]: JSON: Parsing and serializing numbers, often undesired E notation
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1528][#1528]]: Computed node constructors: observations
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1484][#1484]]: Functions that expect a record type should make it extensible
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1479][#1479]]: Default element namespace in XQuery: interaction of 'fixed' and '##any'
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1459][#1459]]: Function properties and arities (editorial)
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1310][#1310]]: add fn:match-groups() function
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1307][#1307]]: For symmetry, add functions array:scan-left and array:scan-right
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1175][#1175]]: XPath: Optional parameters in the definition of an inline function
+ Issue [[https://github.com/qt4cg/qtspecs/issues/760][#760]]: Serialize functions: consistency
+ Issue [[https://github.com/qt4cg/qtspecs/issues/641][#641]]: Serialization fallback.
+ Issue [[https://github.com/qt4cg/qtspecs/issues/115][#115]]: Lookup operator on arrays of maps

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** Review of pull requests
:PROPERTIES:
:CUSTOM_ID: technical-prs
:END:

** What about fn:chain?
:PROPERTIES:
:CUSTOM_ID: h-061025D7-C926-499B-A5CC-B6B436C704BC
:END:

We had a couple of meetings discussing the proposal to replace ~fn:chain~ with
~fn:compose~. The PR for discussion this week simply removes ~fn:chain~. (In
previous straw polls, no one preferred “only fn:chain”; this PR changes the
status quo to reflect that.)

I don’t expect there’s a lot of new technical ground to cover here, so we’ll
attempt to time box the discussion. Ultimately, I hope the CG can express a
clear consensus and that everyone in the minority can accept that consensus.

See PR [[https://qt4cg.org/dashboard/#pr-1984][#1984]]: 882 Drop fn:chain, and PR [[https://qt4cg.org/dashboard/#pr-1894][#1894]]: Additional examples to fn:chain

** PR #1959: 1953 (part) XSLT Worked example using methods to implement atomic sets
:PROPERTIES:
:CUSTOM_ID: pr-1959
:END:
See  PR [[https://qt4cg.org/dashboard/#pr-1959][#1959]]
** PR #2011: 675(part): Add XSLT static typing rules for new kinds of XPath expression
:PROPERTIES:
:CUSTOM_ID: pr-2011
:END:
See  PR [[https://qt4cg.org/dashboard/#pr-2011][#2011]]
** PR #1942: 37 Support sequence, array, and map destructuring declarations
:PROPERTIES:
:CUSTOM_ID: pr-1942
:END:
See  PR [[https://qt4cg.org/dashboard/#pr-1942][#1942]]
** PR #1888: 366 xsl:package-location
:PROPERTIES:
:CUSTOM_ID: pr-1888
:END:
See  PR [[https://qt4cg.org/dashboard/#pr-1888][#1888]]
** PR #2013: 748 Parse functions: consistency
:PROPERTIES:
:CUSTOM_ID: pr-2013
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2013][#2013]]
** PR #2019: 1776: XSLT template rules for maps and array
:PROPERTIES:
:CUSTOM_ID: pr-2019
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]
** PR #2015: 2009 Avoid constructing document node when it makes no sense
:PROPERTIES:
:CUSTOM_ID: pr-2015
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2015][#2015]]
