meeting/agenda/2025/05-27.html

<div id="outline-container-triage" class="outline-4">
<h4 id="triage"><span class="section-number-4">1.6.5.</span> To be triaged</h4>
<div class="outline-text-4" id="text-triage">
<p>
The following issues need to be triaged.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2025">#2025</a>: Combine the concepts of pins/labels and modified lookups</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2022">#2022</a>: Simplify optional XQuery conformance features</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2021">#2021</a>: XSLT: Move "Patterns" section into "Template Rules"</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2018">#2018</a>: Type-checking the result of xsl:apply-templates</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2017">#2017</a>: `fn:sort-by`: Observations</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2016">#2016</a>: File Module: Incorporate changes</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2012">#2012</a>: Add array:sort-with</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2010">#2010</a>: XSLT patterns: generalize union, intersect, and except</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2007">#2007</a>: Creating arrays in XSLT</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2003">#2003</a>: Conditional entries in map constructors</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2002">#2002</a>: Adaptive serialization: QNames</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2000">#2000</a>: element-to-map() - type signature of plan</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1996">#1996</a>: Lookups, KeySpecifier: add NumericLiteral and ContextValueRef?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1995">#1995</a>: Consistency: array lookups</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1980">#1980</a>: HTML serialization: the rules for adding a meta element need to be aligned with HTML5</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1979">#1979</a>: Records: Type Safety</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1970">#1970</a>: Editorial notes</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1955">#1955</a>: fn:doc, fn:parse-xml: entity expansion</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1949">#1949</a>: fn:element-to-map: Updated Feedback</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1948">#1948</a>: fn:element-to-map: Tests</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1946">#1946</a>: We need examples of a record with an entry that is a %method and invoking this method with the result it must produce</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1944">#1944</a>: Try/Catch/Finally - order of evaluation</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1938">#1938</a>: Invoking coerced methods</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1935">#1935</a>: doc-available() with invalid options</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1934">#1934</a>: Supporting RELAX NG validation</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1920">#1920</a>: Parse functions: determinism</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1912">#1912</a>: Error handling: `fn:throw`</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1903">#1903</a>: `fn:scan-left`, `fn:scan-right`: missing steps</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1885">#1885</a>: Use the spcification grammar markup to define the regular expression grammar in F&amp;O</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1871">#1871</a>: Arrays and maps: consistency</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1868">#1868</a>: array:members() to include index position</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1859">#1859</a>: Question on `fn:chain` and `err:FOAP0001`</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1852">#1852</a>: fn:values-except: Return atomic values that occur in A but not in B</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1787">#1787</a>: Sorted maps revisited</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1775">#1775</a>: Navigation in JSON trees</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1774">#1774</a>: Nomenclature: relabelling</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1736">#1736</a>: Add option retain-order=false when constructing maps</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1718">#1718</a>: Ordered Maps: positions in callback functions</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1697">#1697</a>: Add documentary names to callback function signatures</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1618">#1618</a>: Adaptive serialization: doubles</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1591">#1591</a>: Implausible filter expressions</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1583">#1583</a>: JSON: Parsing and serializing numbers, often undesired E notation</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1528">#1528</a>: Computed node constructors: observations</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1484">#1484</a>: Functions that expect a record type should make it extensible</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1479">#1479</a>: Default element namespace in XQuery: interaction of 'fixed' and '##any'</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1459">#1459</a>: Function properties and arities (editorial)</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1310">#1310</a>: add fn:match-groups() function</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1307">#1307</a>: For symmetry, add functions array:scan-left and array:scan-right</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1175">#1175</a>: XPath: Optional parameters in the definition of an inline function</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/760">#760</a>: Serialize functions: consistency</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/641">#641</a>: Serialization fallback.</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/115">#115</a>: Lookup operator on arrays of maps</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-technical-prs" class="outline-3">
<h3 id="technical-prs"><span class="section-number-3">2.1.</span> Review of pull requests</h3>
<div class="outline-text-3" id="text-technical-prs">
</div>
</div>

<div id="outline-container-h-061025D7-C926-499B-A5CC-B6B436C704BC" class="outline-3">
<h3 id="h-061025D7-C926-499B-A5CC-B6B436C704BC"><span class="section-number-3">2.2.</span> What about fn:chain?</h3>
<div class="outline-text-3" id="text-h-061025D7-C926-499B-A5CC-B6B436C704BC">
<p>
We had a couple of meetings discussing the proposal to replace <code>fn:chain</code> with
<code>fn:compose</code>. The PR for discussion this week simply removes <code>fn:chain</code>. (In
previous straw polls, no one preferred “only fn:chain”; this PR changes the
status quo to reflect that.)
</p>

<p>
I don’t expect there’s a lot of new technical ground to cover here, so we’ll
attempt to time box the discussion. Ultimately, I hope the CG can express a
clear consensus and that everyone in the minority can accept that consensus.
</p>

<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1984">#1984</a>: 882 Drop fn:chain, and PR <a href="https://qt4cg.org/dashboard/#pr-1894">#1894</a>: Additional examples to fn:chain
</p>
</div>
</div>
